CoreAPI/files/xml/NM.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:shop="urn:kecrpg.com:HANA:PlanToProduce/ShopLinkWorkCenterAssignment">
  <soapenv:Header />
  <soapenv:Body>
    <shop:MT_WorkCenterAssignment>
      <!--1 or more repetitions:-->
      <RecordSet>
        <WADOCO>000003701738</WADOCO>
        <IROPNO>10</IROPNO>
        <Machine>IWC1</Machine>
      </RecordSet>
      <RecordSet>
        <WADOCO>000003701738</WADOCO>
        <IROPNO>40</IROPNO>
        <Machine>IWC1</Machine>
      </RecordSet>
      <RecordSet>
        <WADOCO>000003701738</WADOCO>
        <IROPNO>50</IROPNO>
        <Machine>IWC1</Machine>
      </RecordSet>
      <RecordSet>
        <WADOCO>000003701738</WADOCO>
        <IROPNO>70</IROPNO>
        <Machine>IWC1</Machine>
      </RecordSet>
      <RecordSet>
        <WADOCO>000003701738</WADOCO>
        <IROPNO>90</IROPNO>
        <Machine>IWC1</Machine>
      </RecordSet>
    </shop:MT_WorkCenterAssignment>
  </soapenv:Body>
</soapenv:Envelope>